MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
/*  Bit definition for GPIO_POERB register  */
#define GPIO_POERB_POUTE00_POS                         (0U)
#define GPIO_POERB_POUTE00                             (0x0001U)
#define GPIO_POERB_POUTE03_POS                         (3U)
#define GPIO_POERB_POUTE03                             (0x0008U)
#define GPIO_POERB_POUTE04_POS                         (4U)
#define GPIO_POERB_POUTE04                             (0x0010U)
#define GPIO_POERB_POUTE05_POS                         (5U)
#define GPIO_POERB_POUTE05                             (0x0020U)
#define GPIO_POERB_POUTE06_POS                         (6U)
#define GPIO_POERB_POUTE06                             (0x0040U)
#define GPIO_POERB_POUTE07_POS                         (7U)
#define GPIO_POERB_POUTE07                             (0x0080U)
#define GPIO_POERB_POUTE13_POS                         (12U)
#define GPIO_POERB_POUTE13                             (0x1000U)
#define GPIO_POERB_POUTE13_POS                         (13U)
#define GPIO_POERB_POUTE13                             (0x2000U)

/*  Bit definition for GPIO_POSRB register  */
#define GPIO_POSRB_POS00_POS                           (0U)
#define GPIO_POSRB_POS00                               (0x0001U)
#define GPIO_POSRB_POS03_POS                           (3U)
#define GPIO_POSRB_POS03                               (0x0008U)
#define GPIO_POSRB_POS04_POS                           (4U)
#define GPIO_POSRB_POS04                               (0x0010U)
#define GPIO_POSRB_POS05_POS                           (5U)
#define GPIO_POSRB_POS05                               (0x0020U)
#define GPIO_POSRB_POS06_POS                           (6U)
#define GPIO_POSRB_POS06                               (0x0040U)
#define GPIO_POSRB_POS07_POS                           (7U)
#define GPIO_POSRB_POS07                               (0x0080U)
#define GPIO_POSRB_POS12_POS                           (12U)
#define GPIO_POSRB_POS12                               (0x1000U)
#define GPIO_POSRB_POS13_POS                           (13U)
#define GPIO_POSRB_POS13                               (0x2000U)

/*  Bit definition for GPIO_PORRB register  */
#define GPIO_PORRB_POR00_POS                           (0U)
#define GPIO_PORRB_POR00                               (0x0001U)
#define GPIO_PORRB_POR03_POS                           (3U)
#define GPIO_PORRB_POR03                               (0x0008U)
#define GPIO_PORRB_POR04_POS                           (4U)
#define GPIO_PORRB_POR04                               (0x0010U)
#define GPIO_PORRB_POR05_POS                           (5U)
#define GPIO_PORRB_POR05                               (0x0020U)
#define GPIO_PORRB_POR06_POS                           (6U)
#define GPIO_PORRB_POR06                               (0x0040U)
#define GPIO_PORRB_POR07_POS                           (7U)
#define GPIO_PORRB_POR07                               (0x0080U)

/*  Bit definition for GPIO_POTRB register  */
#define GPIO_POTRB_POT00_POS                           (0U)
#define GPIO_POTRB_POT00                               (0x0001U)
#define GPIO_POTRB_POT03_POS                           (3U)
#define GPIO_POTRB_POT03                               (0x0008U)
#define GPIO_POTRB_POT04_POS                           (4U)
#define GPIO_POTRB_POT04                               (0x0010U)
#define GPIO_POTRB_POT05_POS                           (5U)
#define GPIO_POTRB_POT05                               (0x0020U)
#define GPIO_POTRB_POT06_POS                           (6U)
#define GPIO_POTRB_POT06                               (0x0040U)
#define GPIO_POTRB_POT07_POS                           (7U)
#define GPIO_POTRB_POT07                               (0x0080U)
#define GPIO_POTRB_POT12_POS                           (12U)
#define GPIO_POTRB_POT12                               (0x1000U)
#define GPIO_POTRB_POT13_POS                           (13U)
#define GPIO_POTRB_POT13                               (0x2000U)

/*  Bit definition for GPIO_PIDRF register  */
#define GPIO_PIDRF_PIN00_POS                           (0U)
#define GPIO_PIDRF_PIN00                               (0x0001U)
#define GPIO_PIDRF_PIN01_POS                           (1U)
#define GPIO_PIDRF_PIN01                               (0x0002U)
#define GPIO_PIDRF_PIN03_POS                           (3U)
#define GPIO_PIDRF_PIN03                               (0x0008U)

/*  Bit definition for GPIO_PODRF register  */
#define GPIO_PODRF_POUT00_POS                          (0U)
#define GPIO_PODRF_POUT00                              (0x0001U)
#define GPIO_PODRF_POUT01_POS                          (1U)
#define GPIO_PODRF_POUT01                              (0x0002U)
#define GPIO_PODRF_POUT03_POS                          (3U)
#define GPIO_PODRF_POUT03                              (0x0008U)

/*  Bit definition for GPIO_POERF register  */
#define GPIO_POERF_POUTE00_POS                         (0U)
#define GPIO_POERF_POUTE00                             (0x0001U)
#define GPIO_POERF_POUTE01_POS                         (1U)
#define GPIO_POERF_POUTE01                             (0x0002U)
#define GPIO_POERF_POUTE03_POS                         (3U)
#define GPIO_POERF_POUTE03                             (0x0008U)

/*  Bit definition for GPIO_POSRF register  */
#define GPIO_POSRF_POS00_POS                           (0U)
#define GPIO_POSRF_POS00                               (0x0001U)
#define GPIO_POSRF_POS01_POS                           (1U)
#define GPIO_POSRF_POS01                               (0x0002U)
#define GPIO_POSRF_POS03_POS                           (3U)
#define GPIO_POSRF_POS03                               (0x0008U)

/*  Bit definition for GPIO_PORRF register  */
#define GPIO_PORRF_POR00_POS                           (0U)
#define GPIO_PORRF_POR00                               (0x0001U)
#define GPIO_PORRF_POR01_POS                           (1U)
#define GPIO_PORRF_POR01                               (0x0002U)
#define GPIO_PORRF_POR03_POS                           (3U)
#define GPIO_PORRF_POR03                               (0x0008U)

