MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
/*  Bit definition for GPIO_POTRF register  */
#define GPIO_POTRF_POT00_POS                           (0U)
#define GPIO_POTRF_POT00                               (0x0001U)
#define GPIO_POTRF_POT01_POS                           (1U)
#define GPIO_POTRF_POT01                               (0x0002U)
#define GPIO_POTRF_POT03_POS                           (3U)
#define GPIO_POTRF_POT03                               (0x0008U)

/*  Bit definition for GPIO_HRPWM register  */
#define GPIO_HRPWM_HRSEL2_POS                          (2U)
#define GPIO_HRPWM_HRSEL2                              (0x00000004UL)
#define GPIO_HRPWM_HRSEL3_POS                          (3U)
#define GPIO_HRPWM_HRSEL3                              (0x00000008UL)
#define GPIO_HRPWM_HRSEL4_POS                          (4U)
#define GPIO_HRPWM_HRSEL4                              (0x00000010UL)
#define GPIO_HRPWM_HRSEL5_POS                          (5U)
#define GPIO_HRPWM_HRSEL5                              (0x00000020UL)
#define GPIO_HRPWM_HRSEL6_POS                          (6U)
#define GPIO_HRPWM_HRSEL6                              (0x00000040UL)
#define GPIO_HRPWM_HRSEL7_POS                          (7U)
#define GPIO_HRPWM_HRSEL7                              (0x00000080UL)
#define GPIO_HRPWM_HREX2_POS                           (18U)
#define GPIO_HRPWM_HREX2                               (0x00040000UL)
#define GPIO_HRPWM_HREX3_POS                           (19U)
#define GPIO_HRPWM_HREX3                               (0x00080000UL)
#define GPIO_HRPWM_HREX4_POS                           (20U)
#define GPIO_HRPWM_HREX4                               (0x00100000UL)
#define GPIO_HRPWM_HREX5_POS                           (21U)
#define GPIO_HRPWM_HREX5                               (0x00200000UL)
#define GPIO_HRPWM_HREX6_POS                           (22U)
#define GPIO_HRPWM_HREX6                               (0x00400000UL)
#define GPIO_HRPWM_HREX7_POS                           (23U)
#define GPIO_HRPWM_HREX7                               (0x00800000UL)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x001FU)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)
#define GPIO_PSPCR_SPFE_2                              (0x0004U)
#define GPIO_PSPCR_SPFE_3                              (0x0008U)
#define GPIO_PSPCR_SPFE_4                              (0x0010U)

/*  Bit definition for GPIO_PCCR register  */
#define GPIO_PCCR_BFSEL_POS                            (0U)
#define GPIO_PCCR_BFSEL                                (0x003FU)
#define GPIO_PCCR_RDWT_POS                             (12U)
#define GPIO_PCCR_RDWT                                 (0x7000U)

/*  Bit definition for GPIO_PWPR register  */
#define GPIO_PWPR_WE_POS                               (0U)
#define GPIO_PWPR_WE                                   (0x0001U)
#define GPIO_PWPR_WP_POS                               (8U)
#define GPIO_PWPR_WP                                   (0xFF00U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  (0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 (0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   (0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   (0x0030U)
#define GPIO_PCR_DRV_0                                 (0x0010U)
#define GPIO_PCR_DRV_1                                 (0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   (0x0040U)
#define GPIO_PCR_PUD_POS                               (7U)
#define GPIO_PCR_PUD                                   (0x0080U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   (0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  (0x0200U)
#define GPIO_PCR_CINSEL_POS                            (10U)
#define GPIO_PCR_CINSEL                                (0x0400U)
#define GPIO_PCR_INTE_POS                              (12U)
#define GPIO_PCR_INTE                                  (0x1000U)
#define GPIO_PCR_PINAE_POS                             (13U)
#define GPIO_PCR_PINAE                                 (0x2000U)
#define GPIO_PCR_LTE_POS                               (14U)
#define GPIO_PCR_LTE                                   (0x4000U)
#define GPIO_PCR_DDIS_POS                              (15U)
#define GPIO_PCR_DDIS                                  (0x8000U)

/*  Bit definition for GPIO_PFSR register  */
#define GPIO_PFSR_FSEL_POS                             (0U)
#define GPIO_PFSR_FSEL                                 (0x003FU)
#define GPIO_PFSR_BFE_POS                              (8U)
#define GPIO_PFSR_BFE                                  (0x0100U)

/*******************************************************************************
                Bit definition for Peripheral HRPWM
*******************************************************************************/
/*  Bit definition for HRPWM_CNTER register  */
#define HRPWM_CNTER_CNT                                (0x003FFFFFUL)

/*  Bit definition for HRPWM_UPDAR register  */
#define HRPWM_UPDAR_UPDA                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRPERAR register  */
#define HRPWM_HRPERAR_HRPERA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRPERBR register  */
#define HRPWM_HRPERBR_HRPERB                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMAR register  */
#define HRPWM_HRGCMAR_HRGCMA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMBR register  */
#define HRPWM_HRGCMBR_HRGCMB                           (0x003FFFFFUL)

