MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
/*  Bit definition for HRPWM_PCNAR2 register  */
#define HRPWM_PCNAR2_EXEV1UCA_POS                      (0U)
#define HRPWM_PCNAR2_EXEV1UCA                          (0x00000003UL)
#define HRPWM_PCNAR2_EXEV1UCA_0                        (0x00000001UL)
#define HRPWM_PCNAR2_EXEV1UCA_1                        (0x00000002UL)
#define HRPWM_PCNAR2_EXEV2UCA_POS                      (2U)
#define HRPWM_PCNAR2_EXEV2UCA                          (0x0000000CUL)
#define HRPWM_PCNAR2_EXEV2UCA_0                        (0x00000004UL)
#define HRPWM_PCNAR2_EXEV2UCA_1                        (0x00000008UL)
#define HRPWM_PCNAR2_EXEV3UCA_POS                      (4U)
#define HRPWM_PCNAR2_EXEV3UCA                          (0x00000030UL)
#define HRPWM_PCNAR2_EXEV3UCA_0                        (0x00000010UL)
#define HRPWM_PCNAR2_EXEV3UCA_1                        (0x00000020UL)
#define HRPWM_PCNAR2_EXEV4UCA_POS                      (6U)
#define HRPWM_PCNAR2_EXEV4UCA                          (0x000000C0UL)
#define HRPWM_PCNAR2_EXEV4UCA_0                        (0x00000040UL)
#define HRPWM_PCNAR2_EXEV4UCA_1                        (0x00000080UL)
#define HRPWM_PCNAR2_EXEV5UCA_POS                      (8U)
#define HRPWM_PCNAR2_EXEV5UCA                          (0x00000300UL)
#define HRPWM_PCNAR2_EXEV5UCA_0                        (0x00000100UL)
#define HRPWM_PCNAR2_EXEV5UCA_1                        (0x00000200UL)
#define HRPWM_PCNAR2_EXEV6UCA_POS                      (10U)
#define HRPWM_PCNAR2_EXEV6UCA                          (0x00000C00UL)
#define HRPWM_PCNAR2_EXEV6UCA_0                        (0x00000400UL)
#define HRPWM_PCNAR2_EXEV6UCA_1                        (0x00000800UL)
#define HRPWM_PCNAR2_EXEV7UCA_POS                      (12U)
#define HRPWM_PCNAR2_EXEV7UCA                          (0x00003000UL)
#define HRPWM_PCNAR2_EXEV7UCA_0                        (0x00001000UL)
#define HRPWM_PCNAR2_EXEV7UCA_1                        (0x00002000UL)
#define HRPWM_PCNAR2_EXEV8UCA_POS                      (14U)
#define HRPWM_PCNAR2_EXEV8UCA                          (0x0000C000UL)
#define HRPWM_PCNAR2_EXEV8UCA_0                        (0x00004000UL)
#define HRPWM_PCNAR2_EXEV8UCA_1                        (0x00008000UL)
#define HRPWM_PCNAR2_EXEV9UCA_POS                      (16U)
#define HRPWM_PCNAR2_EXEV9UCA                          (0x00030000UL)
#define HRPWM_PCNAR2_EXEV9UCA_0                        (0x00010000UL)
#define HRPWM_PCNAR2_EXEV9UCA_1                        (0x00020000UL)
#define HRPWM_PCNAR2_EXEV10UCA_POS                     (18U)
#define HRPWM_PCNAR2_EXEV10UCA                         (0x000C0000UL)
#define HRPWM_PCNAR2_EXEV10UCA_0                       (0x00040000UL)
#define HRPWM_PCNAR2_EXEV10UCA_1                       (0x00080000UL)
#define HRPWM_PCNAR2_CMEUCA_POS                        (20U)
#define HRPWM_PCNAR2_CMEUCA                            (0x00300000UL)
#define HRPWM_PCNAR2_CMEUCA_0                          (0x00100000UL)
#define HRPWM_PCNAR2_CMEUCA_1                          (0x00200000UL)
#define HRPWM_PCNAR2_CMFUCA_POS                        (22U)
#define HRPWM_PCNAR2_CMFUCA                            (0x00C00000UL)
#define HRPWM_PCNAR2_CMFUCA_0                          (0x00400000UL)
#define HRPWM_PCNAR2_CMFUCA_1                          (0x00800000UL)
#define HRPWM_PCNAR2_SCMAUCA_POS                       (24U)
#define HRPWM_PCNAR2_SCMAUCA                           (0x03000000UL)
#define HRPWM_PCNAR2_SCMAUCA_0                         (0x01000000UL)
#define HRPWM_PCNAR2_SCMAUCA_1                         (0x02000000UL)
#define HRPWM_PCNAR2_SCMBUCA_POS                       (26U)
#define HRPWM_PCNAR2_SCMBUCA                           (0x0C000000UL)
#define HRPWM_PCNAR2_SCMBUCA_0                         (0x04000000UL)
#define HRPWM_PCNAR2_SCMBUCA_1                         (0x08000000UL)

/*  Bit definition for HRPWM_PCNBR2 register  */
#define HRPWM_PCNBR2_EXEV1UCB_POS                      (0U)
#define HRPWM_PCNBR2_EXEV1UCB                          (0x00000003UL)
#define HRPWM_PCNBR2_EXEV1UCB_0                        (0x00000001UL)
#define HRPWM_PCNBR2_EXEV1UCB_1                        (0x00000002UL)
#define HRPWM_PCNBR2_EXEV2UCB_POS                      (2U)
#define HRPWM_PCNBR2_EXEV2UCB                          (0x0000000CUL)
#define HRPWM_PCNBR2_EXEV2UCB_0                        (0x00000004UL)
#define HRPWM_PCNBR2_EXEV2UCB_1                        (0x00000008UL)
#define HRPWM_PCNBR2_EXEV3UCB_POS                      (4U)
#define HRPWM_PCNBR2_EXEV3UCB                          (0x00000030UL)
#define HRPWM_PCNBR2_EXEV3UCB_0                        (0x00000010UL)
#define HRPWM_PCNBR2_EXEV3UCB_1                        (0x00000020UL)
#define HRPWM_PCNBR2_EXEV4UCB_POS                      (6U)
#define HRPWM_PCNBR2_EXEV4UCB                          (0x000000C0UL)
#define HRPWM_PCNBR2_EXEV4UCB_0                        (0x00000040UL)
#define HRPWM_PCNBR2_EXEV4UCB_1                        (0x00000080UL)
#define HRPWM_PCNBR2_EXEV5UCB_POS                      (8U)
#define HRPWM_PCNBR2_EXEV5UCB                          (0x00000300UL)
#define HRPWM_PCNBR2_EXEV5UCB_0                        (0x00000100UL)
#define HRPWM_PCNBR2_EXEV5UCB_1                        (0x00000200UL)
#define HRPWM_PCNBR2_EXEV6UCB_POS                      (10U)
#define HRPWM_PCNBR2_EXEV6UCB                          (0x00000C00UL)
#define HRPWM_PCNBR2_EXEV6UCB_0                        (0x00000400UL)
#define HRPWM_PCNBR2_EXEV6UCB_1                        (0x00000800UL)
#define HRPWM_PCNBR2_EXEV7UCB_POS                      (12U)
#define HRPWM_PCNBR2_EXEV7UCB                          (0x00003000UL)
#define HRPWM_PCNBR2_EXEV7UCB_0                        (0x00001000UL)
#define HRPWM_PCNBR2_EXEV7UCB_1                        (0x00002000UL)
#define HRPWM_PCNBR2_EXEV8UCB_POS                      (14U)
#define HRPWM_PCNBR2_EXEV8UCB                          (0x0000C000UL)
#define HRPWM_PCNBR2_EXEV8UCB_0                        (0x00004000UL)
#define HRPWM_PCNBR2_EXEV8UCB_1                        (0x00008000UL)
#define HRPWM_PCNBR2_EXEV9UCB_POS                      (16U)
#define HRPWM_PCNBR2_EXEV9UCB                          (0x00030000UL)
#define HRPWM_PCNBR2_EXEV9UCB_0                        (0x00010000UL)
#define HRPWM_PCNBR2_EXEV9UCB_1                        (0x00020000UL)
#define HRPWM_PCNBR2_EXEV10UCB_POS                     (18U)
#define HRPWM_PCNBR2_EXEV10UCB                         (0x000C0000UL)
#define HRPWM_PCNBR2_EXEV10UCB_0                       (0x00040000UL)
#define HRPWM_PCNBR2_EXEV10UCB_1                       (0x00080000UL)
#define HRPWM_PCNBR2_CMEUCB_POS                        (20U)
#define HRPWM_PCNBR2_CMEUCB                            (0x00300000UL)
#define HRPWM_PCNBR2_CMEUCB_0                          (0x00100000UL)
#define HRPWM_PCNBR2_CMEUCB_1                          (0x00200000UL)
#define HRPWM_PCNBR2_CMFUCB_POS                        (22U)
#define HRPWM_PCNBR2_CMFUCB                            (0x00C00000UL)
#define HRPWM_PCNBR2_CMFUCB_0                          (0x00400000UL)
#define HRPWM_PCNBR2_CMFUCB_1                          (0x00800000UL)
#define HRPWM_PCNBR2_SCMAUCB_POS                       (24U)
#define HRPWM_PCNBR2_SCMAUCB                           (0x03000000UL)
#define HRPWM_PCNBR2_SCMAUCB_0                         (0x01000000UL)
#define HRPWM_PCNBR2_SCMAUCB_1                         (0x02000000UL)
#define HRPWM_PCNBR2_SCMBUCB_POS                       (26U)
#define HRPWM_PCNBR2_SCMBUCB                           (0x0C000000UL)
#define HRPWM_PCNBR2_SCMBUCB_0                         (0x04000000UL)
#define HRPWM_PCNBR2_SCMBUCB_1                         (0x08000000UL)

/*  Bit definition for HRPWM_HSTAR2 register  */
#define HRPWM_HSTAR2_HSTAEXEV1_POS                     (0U)
#define HRPWM_HSTAR2_HSTAEXEV1                         (0x00000001UL)
#define HRPWM_HSTAR2_HSTAEXEV2_POS                     (1U)
#define HRPWM_HSTAR2_HSTAEXEV2                         (0x00000002UL)
#define HRPWM_HSTAR2_HSTAEXEV3_POS                     (2U)
#define HRPWM_HSTAR2_HSTAEXEV3                         (0x00000004UL)
#define HRPWM_HSTAR2_HSTAEXEV4_POS                     (3U)
#define HRPWM_HSTAR2_HSTAEXEV4                         (0x00000008UL)
#define HRPWM_HSTAR2_HSTAEXEV5_POS                     (4U)
#define HRPWM_HSTAR2_HSTAEXEV5                         (0x00000010UL)
#define HRPWM_HSTAR2_HSTAEXEV6_POS                     (5U)
#define HRPWM_HSTAR2_HSTAEXEV6                         (0x00000020UL)
#define HRPWM_HSTAR2_HSTAEXEV7_POS                     (6U)
#define HRPWM_HSTAR2_HSTAEXEV7                         (0x00000040UL)
#define HRPWM_HSTAR2_HSTAEXEV8_POS                     (7U)
#define HRPWM_HSTAR2_HSTAEXEV8                         (0x00000080UL)
#define HRPWM_HSTAR2_HSTAEXEV9_POS                     (8U)
#define HRPWM_HSTAR2_HSTAEXEV9                         (0x00000100UL)
#define HRPWM_HSTAR2_HSTAEXEV10_POS                    (9U)
#define HRPWM_HSTAR2_HSTAEXEV10                        (0x00000200UL)
#define HRPWM_HSTAR2_HSTAGCMA1_POS                     (10U)
#define HRPWM_HSTAR2_HSTAGCMA1                         (0x00000400UL)
#define HRPWM_HSTAR2_HSTAGCMB1_POS                     (11U)
#define HRPWM_HSTAR2_HSTAGCMB1                         (0x00000800UL)
#define HRPWM_HSTAR2_HSTAGCMA2_POS                     (12U)
#define HRPWM_HSTAR2_HSTAGCMA2                         (0x00001000UL)
#define HRPWM_HSTAR2_HSTAGCMB2_POS                     (13U)
#define HRPWM_HSTAR2_HSTAGCMB2                         (0x00002000UL)
#define HRPWM_HSTAR2_HSTAGCMA3_POS                     (14U)
#define HRPWM_HSTAR2_HSTAGCMA3                         (0x00004000UL)
#define HRPWM_HSTAR2_HSTAGCMB3_POS                     (15U)
#define HRPWM_HSTAR2_HSTAGCMB3                         (0x00008000UL)
#define HRPWM_HSTAR2_HSTAGCMA4_POS                     (16U)
#define HRPWM_HSTAR2_HSTAGCMA4                         (0x00010000UL)
#define HRPWM_HSTAR2_HSTAGCMB4_POS                     (17U)
#define HRPWM_HSTAR2_HSTAGCMB4                         (0x00020000UL)
#define HRPWM_HSTAR2_HSTAGCMA5_POS                     (18U)
#define HRPWM_HSTAR2_HSTAGCMA5                         (0x00040000UL)
#define HRPWM_HSTAR2_HSTAGCMB5_POS                     (19U)
#define HRPWM_HSTAR2_HSTAGCMB5                         (0x00080000UL)
#define HRPWM_HSTAR2_HSTAGCMA6_POS                     (20U)
#define HRPWM_HSTAR2_HSTAGCMA6                         (0x00100000UL)
#define HRPWM_HSTAR2_HSTAGCMB6_POS                     (21U)
#define HRPWM_HSTAR2_HSTAGCMB6                         (0x00200000UL)
#define HRPWM_HSTAR2_HSTASCMA1_POS                     (22U)
#define HRPWM_HSTAR2_HSTASCMA1                         (0x00400000UL)
#define HRPWM_HSTAR2_HSTASCMB2_POS                     (23U)
#define HRPWM_HSTAR2_HSTASCMB2                         (0x00800000UL)
#define HRPWM_HSTAR2_HSTASCMB3_POS                     (24U)
#define HRPWM_HSTAR2_HSTASCMB3                         (0x01000000UL)
#define HRPWM_HSTAR2_HSTASCMB4_POS                     (25U)
#define HRPWM_HSTAR2_HSTASCMB4                         (0x02000000UL)
#define HRPWM_HSTAR2_HSTASCMB5_POS                     (26U)
#define HRPWM_HSTAR2_HSTASCMB5                         (0x04000000UL)
#define HRPWM_HSTAR2_HSTASCMB6_POS                     (27U)
#define HRPWM_HSTAR2_HSTASCMB6                         (0x08000000UL)

