MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
/*  Bit definition for MCAN_TOCC register  */
#define MCAN_TOCC_ETOC_POS                             (0U)
#define MCAN_TOCC_ETOC                                 (0x00000001UL)
#define MCAN_TOCC_TOS_POS                              (1U)
#define MCAN_TOCC_TOS                                  (0x00000006UL)
#define MCAN_TOCC_TOS_0                                (0x00000002UL)
#define MCAN_TOCC_TOS_1                                (0x00000004UL)
#define MCAN_TOCC_TOP_POS                              (16U)
#define MCAN_TOCC_TOP                                  (0xFFFF0000UL)

/*  Bit definition for MCAN_TOCV register  */
#define MCAN_TOCV_TOC                                  (0x0000FFFFUL)

/*  Bit definition for MCAN_ECR register  */
#define MCAN_ECR_TEC_POS                               (0U)
#define MCAN_ECR_TEC                                   (0x000000FFUL)
#define MCAN_ECR_REC_POS                               (8U)
#define MCAN_ECR_REC                                   (0x00007F00UL)
#define MCAN_ECR_RP_POS                                (15U)
#define MCAN_ECR_RP                                    (0x00008000UL)
#define MCAN_ECR_CEL_POS                               (16U)
#define MCAN_ECR_CEL                                   (0x00FF0000UL)

/*  Bit definition for MCAN_PSR register  */
#define MCAN_PSR_LEC_POS                               (0U)
#define MCAN_PSR_LEC                                   (0x00000007UL)
#define MCAN_PSR_ACT_POS                               (3U)
#define MCAN_PSR_ACT                                   (0x00000018UL)
#define MCAN_PSR_ACT_0                                 (0x00000008UL)
#define MCAN_PSR_ACT_1                                 (0x00000010UL)
#define MCAN_PSR_EP_POS                                (5U)
#define MCAN_PSR_EP                                    (0x00000020UL)
#define MCAN_PSR_EW_POS                                (6U)
#define MCAN_PSR_EW                                    (0x00000040UL)
#define MCAN_PSR_BO_POS                                (7U)
#define MCAN_PSR_BO                                    (0x00000080UL)
#define MCAN_PSR_DLEC_POS                              (8U)
#define MCAN_PSR_DLEC                                  (0x00000700UL)
#define MCAN_PSR_RESI_POS                              (11U)
#define MCAN_PSR_RESI                                  (0x00000800UL)
#define MCAN_PSR_RBRS_POS                              (12U)
#define MCAN_PSR_RBRS                                  (0x00001000UL)
#define MCAN_PSR_RFDF_POS                              (13U)
#define MCAN_PSR_RFDF                                  (0x00002000UL)
#define MCAN_PSR_PXE_POS                               (14U)
#define MCAN_PSR_PXE                                   (0x00004000UL)
#define MCAN_PSR_TDCV_POS                              (16U)
#define MCAN_PSR_TDCV                                  (0x007F0000UL)

/*  Bit definition for MCAN_TDCR register  */
#define MCAN_TDCR_TDCF_POS                             (0U)
#define MCAN_TDCR_TDCF                                 (0x0000007FUL)
#define MCAN_TDCR_TDCO_POS                             (8U)
#define MCAN_TDCR_TDCO                                 (0x00007F00UL)

/*  Bit definition for MCAN_IR register  */
#define MCAN_IR_RF0N_POS                               (0U)
#define MCAN_IR_RF0N                                   (0x00000001UL)
#define MCAN_IR_RF0W_POS                               (1U)
#define MCAN_IR_RF0W                                   (0x00000002UL)
#define MCAN_IR_RF0F_POS                               (2U)
#define MCAN_IR_RF0F                                   (0x00000004UL)
#define MCAN_IR_RF0L_POS                               (3U)
#define MCAN_IR_RF0L                                   (0x00000008UL)
#define MCAN_IR_RF1N_POS                               (4U)
#define MCAN_IR_RF1N                                   (0x00000010UL)
#define MCAN_IR_RF1W_POS                               (5U)
#define MCAN_IR_RF1W                                   (0x00000020UL)
#define MCAN_IR_RF1F_POS                               (6U)
#define MCAN_IR_RF1F                                   (0x00000040UL)
#define MCAN_IR_RF1L_POS                               (7U)
#define MCAN_IR_RF1L                                   (0x00000080UL)
#define MCAN_IR_HPM_POS                                (8U)
#define MCAN_IR_HPM                                    (0x00000100UL)
#define MCAN_IR_TC_POS                                 (9U)
#define MCAN_IR_TC                                     (0x00000200UL)
#define MCAN_IR_TCF_POS                                (10U)
#define MCAN_IR_TCF                                    (0x00000400UL)
#define MCAN_IR_TFE_POS                                (11U)
#define MCAN_IR_TFE                                    (0x00000800UL)
#define MCAN_IR_TEFN_POS                               (12U)
#define MCAN_IR_TEFN                                   (0x00001000UL)
#define MCAN_IR_TEFW_POS                               (13U)
#define MCAN_IR_TEFW                                   (0x00002000UL)
#define MCAN_IR_TEFF_POS                               (14U)
#define MCAN_IR_TEFF                                   (0x00004000UL)
#define MCAN_IR_TEFL_POS                               (15U)
#define MCAN_IR_TEFL                                   (0x00008000UL)
#define MCAN_IR_TSW_POS                                (16U)
#define MCAN_IR_TSW                                    (0x00010000UL)
#define MCAN_IR_MRAF_POS                               (17U)
#define MCAN_IR_MRAF                                   (0x00020000UL)
#define MCAN_IR_TOO_POS                                (18U)
#define MCAN_IR_TOO                                    (0x00040000UL)
#define MCAN_IR_DRX_POS                                (19U)
#define MCAN_IR_DRX                                    (0x00080000UL)
#define MCAN_IR_BEC_POS                                (20U)
#define MCAN_IR_BEC                                    (0x00100000UL)
#define MCAN_IR_BEU_POS                                (21U)
#define MCAN_IR_BEU                                    (0x00200000UL)
#define MCAN_IR_ELO_POS                                (22U)
#define MCAN_IR_ELO                                    (0x00400000UL)
#define MCAN_IR_EP_POS                                 (23U)
#define MCAN_IR_EP                                     (0x00800000UL)
#define MCAN_IR_EW_POS                                 (24U)
#define MCAN_IR_EW                                     (0x01000000UL)
#define MCAN_IR_BO_POS                                 (25U)
#define MCAN_IR_BO                                     (0x02000000UL)
#define MCAN_IR_WDI_POS                                (26U)
#define MCAN_IR_WDI                                    (0x04000000UL)
#define MCAN_IR_PEA_POS                                (27U)
#define MCAN_IR_PEA                                    (0x08000000UL)
#define MCAN_IR_PED_POS                                (28U)
#define MCAN_IR_PED                                    (0x10000000UL)
#define MCAN_IR_ARA_POS                                (29U)
#define MCAN_IR_ARA                                    (0x20000000UL)

/*  Bit definition for MCAN_IE register  */
#define MCAN_IE_RF0NE_POS                              (0U)
#define MCAN_IE_RF0NE                                  (0x00000001UL)
#define MCAN_IE_RF0WE_POS                              (1U)
#define MCAN_IE_RF0WE                                  (0x00000002UL)
#define MCAN_IE_RF0FE_POS                              (2U)
#define MCAN_IE_RF0FE                                  (0x00000004UL)
#define MCAN_IE_RF0LE_POS                              (3U)
#define MCAN_IE_RF0LE                                  (0x00000008UL)
#define MCAN_IE_RF1NE_POS                              (4U)
#define MCAN_IE_RF1NE                                  (0x00000010UL)
#define MCAN_IE_RF1WE_POS                              (5U)
#define MCAN_IE_RF1WE                                  (0x00000020UL)
#define MCAN_IE_RF1FE_POS                              (6U)
#define MCAN_IE_RF1FE                                  (0x00000040UL)
#define MCAN_IE_RF1LE_POS                              (7U)
#define MCAN_IE_RF1LE                                  (0x00000080UL)
#define MCAN_IE_HPME_POS                               (8U)
#define MCAN_IE_HPME                                   (0x00000100UL)
#define MCAN_IE_TCE_POS                                (9U)
#define MCAN_IE_TCE                                    (0x00000200UL)
#define MCAN_IE_TCFE_POS                               (10U)
#define MCAN_IE_TCFE                                   (0x00000400UL)
#define MCAN_IE_TFEE_POS                               (11U)
#define MCAN_IE_TFEE                                   (0x00000800UL)
#define MCAN_IE_TEFNE_POS                              (12U)
#define MCAN_IE_TEFNE                                  (0x00001000UL)
#define MCAN_IE_TEFWE_POS                              (13U)
#define MCAN_IE_TEFWE                                  (0x00002000UL)
#define MCAN_IE_TEFFE_POS                              (14U)
#define MCAN_IE_TEFFE                                  (0x00004000UL)
#define MCAN_IE_TEFLE_POS                              (15U)
#define MCAN_IE_TEFLE                                  (0x00008000UL)
#define MCAN_IE_TSWE_POS                               (16U)
#define MCAN_IE_TSWE                                   (0x00010000UL)
#define MCAN_IE_MRAFE_POS                              (17U)
#define MCAN_IE_MRAFE                                  (0x00020000UL)
#define MCAN_IE_TOOE_POS                               (18U)
#define MCAN_IE_TOOE                                   (0x00040000UL)
#define MCAN_IE_DRXE_POS                               (19U)
#define MCAN_IE_DRXE                                   (0x00080000UL)
#define MCAN_IE_BECE_POS                               (20U)
#define MCAN_IE_BECE                                   (0x00100000UL)
#define MCAN_IE_BEUE_POS                               (21U)
#define MCAN_IE_BEUE                                   (0x00200000UL)
#define MCAN_IE_ELOE_POS                               (22U)
#define MCAN_IE_ELOE                                   (0x00400000UL)
#define MCAN_IE_EPE_POS                                (23U)
#define MCAN_IE_EPE                                    (0x00800000UL)
#define MCAN_IE_EWE_POS                                (24U)
#define MCAN_IE_EWE                                    (0x01000000UL)
#define MCAN_IE_BOE_POS                                (25U)
#define MCAN_IE_BOE                                    (0x02000000UL)
#define MCAN_IE_WDIE_POS                               (26U)
#define MCAN_IE_WDIE                                   (0x04000000UL)
#define MCAN_IE_PEAE_POS                               (27U)
#define MCAN_IE_PEAE                                   (0x08000000UL)
#define MCAN_IE_PEDE_POS                               (28U)
#define MCAN_IE_PEDE                                   (0x10000000UL)
#define MCAN_IE_ARAE_POS                               (29U)
#define MCAN_IE_ARAE                                   (0x20000000UL)

