MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
/*******************************************************************************
                Bit definition for Peripheral RMU
*******************************************************************************/
/*  Bit definition for RMU_FRST0 register  */
#define RMU_FRST0_PLA_POS                              (11U)
#define RMU_FRST0_PLA                                  (0x00000800UL)
#define RMU_FRST0_DMA_POS                              (14U)
#define RMU_FRST0_DMA                                  (0x00004000UL)
#define RMU_FRST0_FCM_POS                              (16U)
#define RMU_FRST0_FCM                                  (0x00010000UL)
#define RMU_FRST0_AOS_POS                              (17U)
#define RMU_FRST0_AOS                                  (0x00020000UL)
#define RMU_FRST0_CTC_POS                              (18U)
#define RMU_FRST0_CTC                                  (0x00040000UL)
#define RMU_FRST0_CRC_POS                              (23U)
#define RMU_FRST0_CRC                                  (0x00800000UL)

/*  Bit definition for RMU_FRST1 register  */
#define RMU_FRST1_MCAN1_POS                            (0U)
#define RMU_FRST1_MCAN1                                (0x00000001UL)
#define RMU_FRST1_MCAN2_POS                            (1U)
#define RMU_FRST1_MCAN2                                (0x00000002UL)
#define RMU_FRST1_I2C_POS                              (4U)
#define RMU_FRST1_I2C                                  (0x00000010UL)
#define RMU_FRST1_SPI_POS                              (16U)
#define RMU_FRST1_SPI                                  (0x00010000UL)

/*  Bit definition for RMU_FRST2 register  */
#define RMU_FRST2_TMR6_POS                             (0U)
#define RMU_FRST2_TMR6                                 (0x00000001UL)
#define RMU_FRST2_TMR4_POS                             (8U)
#define RMU_FRST2_TMR4                                 (0x00000100UL)
#define RMU_FRST2_HRPWM_POS                            (11U)
#define RMU_FRST2_HRPWM                                (0x00000800UL)
#define RMU_FRST2_TMR0_1_POS                           (12U)
#define RMU_FRST2_TMR0_1                               (0x00001000UL)
#define RMU_FRST2_TMR0_2_POS                           (13U)
#define RMU_FRST2_TMR0_2                               (0x00002000UL)
#define RMU_FRST2_EMB_POS                              (15U)
#define RMU_FRST2_EMB                                  (0x00008000UL)
#define RMU_FRST2_TMRA_1_POS                           (20U)
#define RMU_FRST2_TMRA_1                               (0x00100000UL)
#define RMU_FRST2_TMRA_2_POS                           (21U)
#define RMU_FRST2_TMRA_2                               (0x00200000UL)
#define RMU_FRST2_TMRA_3_POS                           (22U)
#define RMU_FRST2_TMRA_3                               (0x00400000UL)
#define RMU_FRST2_TMRA_4_POS                           (23U)
#define RMU_FRST2_TMRA_4                               (0x00800000UL)
#define RMU_FRST2_TMRA_5_POS                           (24U)
#define RMU_FRST2_TMRA_5                               (0x01000000UL)

/*  Bit definition for RMU_FRST3 register  */
#define RMU_FRST3_ADC1_POS                             (0U)
#define RMU_FRST3_ADC1                                 (0x00000001UL)
#define RMU_FRST3_ADC2_POS                             (1U)
#define RMU_FRST3_ADC2                                 (0x00000002UL)
#define RMU_FRST3_ADC3_POS                             (2U)
#define RMU_FRST3_ADC3                                 (0x00000004UL)
#define RMU_FRST3_DAC1_POS                             (4U)
#define RMU_FRST3_DAC1                                 (0x00000010UL)
#define RMU_FRST3_DAC2_POS                             (5U)
#define RMU_FRST3_DAC2                                 (0x00000020UL)
#define RMU_FRST3_CMP12_POS                            (8U)
#define RMU_FRST3_CMP12                                (0x00000100UL)
#define RMU_FRST3_CMP3_POS                             (9U)
#define RMU_FRST3_CMP3                                 (0x00000200UL)
#define RMU_FRST3_VREF_POS                             (13U)
#define RMU_FRST3_VREF                                 (0x00002000UL)
#define RMU_FRST3_USART1_POS                           (20U)
#define RMU_FRST3_USART1                               (0x00100000UL)
#define RMU_FRST3_USART2_POS                           (21U)
#define RMU_FRST3_USART2                               (0x00200000UL)
#define RMU_FRST3_USART3_POS                           (22U)
#define RMU_FRST3_USART3                               (0x00400000UL)
#define RMU_FRST3_USART4_POS                           (23U)
#define RMU_FRST3_USART4                               (0x00800000UL)

/*  Bit definition for RMU_PRSTCR0 register  */
#define RMU_PRSTCR0_LKUPREN_POS                        (5U)
#define RMU_PRSTCR0_LKUPREN                            (0x20U)

/*  Bit definition for RMU_RSTF0 register  */
#define RMU_RSTF0_PORF_POS                             (0U)
#define RMU_RSTF0_PORF                                 (0x00000001UL)
#define RMU_RSTF0_PINRF_POS                            (1U)
#define RMU_RSTF0_PINRF                                (0x00000002UL)
#define RMU_RSTF0_BORF_POS                             (2U)
#define RMU_RSTF0_BORF                                 (0x00000004UL)
#define RMU_RSTF0_PVD1RF_POS                           (3U)
#define RMU_RSTF0_PVD1RF                               (0x00000008UL)
#define RMU_RSTF0_PVD2RF_POS                           (4U)
#define RMU_RSTF0_PVD2RF                               (0x00000010UL)
#define RMU_RSTF0_WDRF_POS                             (5U)
#define RMU_RSTF0_WDRF                                 (0x00000020UL)
#define RMU_RSTF0_SWDRF_POS                            (6U)
#define RMU_RSTF0_SWDRF                                (0x00000040UL)
#define RMU_RSTF0_PDRF_POS                             (7U)
#define RMU_RSTF0_PDRF                                 (0x00000080UL)
#define RMU_RSTF0_SWRF_POS                             (8U)
#define RMU_RSTF0_SWRF                                 (0x00000100UL)
#define RMU_RSTF0_MPUERF_POS                           (9U)
#define RMU_RSTF0_MPUERF                               (0x00000200UL)
#define RMU_RSTF0_RAPERF_POS                           (10U)
#define RMU_RSTF0_RAPERF                               (0x00000400UL)
#define RMU_RSTF0_RAECRF_POS                           (11U)
#define RMU_RSTF0_RAECRF                               (0x00000800UL)
#define RMU_RSTF0_CKFERF_POS                           (12U)
#define RMU_RSTF0_CKFERF                               (0x00001000UL)
#define RMU_RSTF0_XTALERF_POS                          (13U)
#define RMU_RSTF0_XTALERF                              (0x00002000UL)
#define RMU_RSTF0_LKUPRF_POS                           (14U)
#define RMU_RSTF0_LKUPRF                               (0x00004000UL)
#define RMU_RSTF0_MULTIRF_POS                          (30U)
#define RMU_RSTF0_MULTIRF                              (0x40000000UL)
#define RMU_RSTF0_CLRF_POS                             (31U)
#define RMU_RSTF0_CLRF                                 (0x80000000UL)

