MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
typedef struct {
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podra_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poera_bit_t;

typedef struct {
    __O  uint32_t POS00;
    __O  uint32_t POS01;
    __O  uint32_t POS02;
    __O  uint32_t POS03;
    __O  uint32_t POS04;
    __O  uint32_t POS05;
    __O  uint32_t POS06;
    __O  uint32_t POS07;
    __O  uint32_t POS08;
    __O  uint32_t POS09;
    __O  uint32_t POS10;
    __O  uint32_t POS11;
    __O  uint32_t POS12;
    __O  uint32_t POS13;
    __O  uint32_t POS14;
    __O  uint32_t POS15;
} stc_gpio_posra_bit_t;

typedef struct {
    __O  uint32_t POR00;
    __O  uint32_t POR01;
    __O  uint32_t POR02;
    __O  uint32_t POR03;
    __O  uint32_t POR04;
    __O  uint32_t POR05;
    __O  uint32_t POR06;
    __O  uint32_t POR07;
    __O  uint32_t POR08;
    __O  uint32_t POR09;
    __O  uint32_t POR10;
    __O  uint32_t POR11;
    __O  uint32_t POR12;
    __O  uint32_t POR13;
    __O  uint32_t POR14;
    __O  uint32_t POR15;
} stc_gpio_porra_bit_t;

typedef struct {
    __O  uint32_t POT00;
    __O  uint32_t POT01;
    __O  uint32_t POT02;
    __O  uint32_t POT03;
    __O  uint32_t POT04;
    __O  uint32_t POT05;
    __O  uint32_t POT06;
    __O  uint32_t POT07;
    __O  uint32_t POT08;
    __O  uint32_t POT09;
    __O  uint32_t POT10;
    __O  uint32_t POT11;
    __O  uint32_t POT12;
    __O  uint32_t POT13;
    __O  uint32_t POT14;
    __O  uint32_t POT15;
} stc_gpio_potra_bit_t;

typedef struct {
    __I  uint32_t PIN00;
    uint32_t RESERVED0[2];
    __I  uint32_t PIN03;
    __I  uint32_t PIN04;
    __I  uint32_t PIN05;
    __I  uint32_t PIN06;
    __I  uint32_t PIN07;
    uint32_t RESERVED1[4];
    __I  uint32_t PIN12;
    __I  uint32_t PIN13;
    uint32_t RESERVED2[2];
} stc_gpio_pidrb_bit_t;

typedef struct {
    __IO uint32_t POUT00;
    uint32_t RESERVED0[2];
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    uint32_t RESERVED1[4];
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    uint32_t RESERVED2[2];
} stc_gpio_podrb_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    uint32_t RESERVED0[2];
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    uint32_t RESERVED1[4];
    __IO uint32_t POUTE13;
    uint32_t RESERVED2[2];
} stc_gpio_poerb_bit_t;

typedef struct {
    __O  uint32_t POS00;
    uint32_t RESERVED0[2];
    __O  uint32_t POS03;
    __O  uint32_t POS04;
    __O  uint32_t POS05;
    __O  uint32_t POS06;
    __O  uint32_t POS07;
    uint32_t RESERVED1[4];
    __O  uint32_t POS12;
    __O  uint32_t POS13;
    uint32_t RESERVED2[2];
} stc_gpio_posrb_bit_t;

typedef struct {
    __O  uint32_t POR00;
    uint32_t RESERVED0[2];
    __O  uint32_t POR03;
    __O  uint32_t POR04;
    __O  uint32_t POR05;
    __O  uint32_t POR06;
    __O  uint32_t POR07;
    uint32_t RESERVED1[8];
} stc_gpio_porrb_bit_t;

typedef struct {
    __O  uint32_t POT00;
    uint32_t RESERVED0[2];
    __O  uint32_t POT03;
    __O  uint32_t POT04;
    __O  uint32_t POT05;
    __O  uint32_t POT06;
    __O  uint32_t POT07;
    uint32_t RESERVED1[4];
    __O  uint32_t POT12;
    __O  uint32_t POT13;
    uint32_t RESERVED2[2];
} stc_gpio_potrb_bit_t;

typedef struct {
    __I  uint32_t PIN00;
    __I  uint32_t PIN01;
    uint32_t RESERVED0[1];
    __I  uint32_t PIN03;
    uint32_t RESERVED1[12];
} stc_gpio_pidrf_bit_t;

typedef struct {
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    uint32_t RESERVED0[1];
    __IO uint32_t POUT03;
    uint32_t RESERVED1[12];
} stc_gpio_podrf_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    uint32_t RESERVED0[1];
    __IO uint32_t POUTE03;
    uint32_t RESERVED1[12];
} stc_gpio_poerf_bit_t;

typedef struct {
    __O  uint32_t POS00;
    __O  uint32_t POS01;
    uint32_t RESERVED0[1];
    __O  uint32_t POS03;
    uint32_t RESERVED1[12];
} stc_gpio_posrf_bit_t;

typedef struct {
    __O  uint32_t POR00;
    __O  uint32_t POR01;
    uint32_t RESERVED0[1];
    __O  uint32_t POR03;
    uint32_t RESERVED1[12];
} stc_gpio_porrf_bit_t;

typedef struct {
    __O  uint32_t POT00;
    __O  uint32_t POT01;
    uint32_t RESERVED0[1];
    __O  uint32_t POT03;
    uint32_t RESERVED1[12];
} stc_gpio_potrf_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t HRSEL2;
    __IO uint32_t HRSEL3;
    __IO uint32_t HRSEL4;
    __IO uint32_t HRSEL5;
    __IO uint32_t HRSEL6;
    __IO uint32_t HRSEL7;
    uint32_t RESERVED1[10];
    __IO uint32_t HREX2;
    __IO uint32_t HREX3;
    __IO uint32_t HREX4;
    __IO uint32_t HREX5;
    __IO uint32_t HREX6;
    __IO uint32_t HREX7;
    uint32_t RESERVED2[8];
} stc_gpio_hrpwm_bit_t;

typedef struct {
    __IO uint32_t WE;
    uint32_t RESERVED0[15];
} stc_gpio_pwpr_bit_t;

typedef struct {
    __IO uint32_t POUT;
    __IO uint32_t POUTE;
    __IO uint32_t NOD;
    uint32_t RESERVED0[3];
    __IO uint32_t PUU;
    __IO uint32_t PUD;
    __I  uint32_t PIN;
    __IO uint32_t INVE;
    __IO uint32_t CINSEL;
    uint32_t RESERVED1[1];
    __IO uint32_t INTE;
    __IO uint32_t PINAE;
    __IO uint32_t LTE;
    __IO uint32_t DDIS;
} stc_gpio_pcr_bit_t;

