MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t BFE;
    uint32_t RESERVED1[7];
} stc_gpio_pfsr_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __I  uint32_t CAPDIRA;
    uint32_t RESERVED1[9];
} stc_hrpwm_capar_bit_t;

typedef struct {
    uint32_t RESERVED0[22];
    __I  uint32_t CAPDIRB;
    uint32_t RESERVED1[9];
} stc_hrpwm_capbr_bit_t;

typedef struct {
    __IO uint32_t START;
    uint32_t RESERVED0[1];
    __IO uint32_t MODE;
    uint32_t RESERVED1[5];
    __IO uint32_t OVSTP;
    uint32_t RESERVED2[23];
} stc_hrpwm_gconr_bit_t;

typedef struct {
    __IO uint32_t INTENA;
    __IO uint32_t INTENB;
    __IO uint32_t INTENC;
    __IO uint32_t INTEND;
    __IO uint32_t INTENE;
    __IO uint32_t INTENF;
    __IO uint32_t INTENOVF;
    __IO uint32_t INTENUDF;
    uint32_t RESERVED0[6];
    __IO uint32_t INTENCAPA;
    __IO uint32_t INTENCAPB;
    __IO uint32_t INTENSAU;
    __IO uint32_t INTENSAD;
    __IO uint32_t INTENSBU;
    __IO uint32_t INTENSBD;
    uint32_t RESERVED1[12];
} stc_hrpwm_iconr_bit_t;

typedef struct {
    __IO uint32_t BENAE;
    uint32_t RESERVED0[1];
    __IO uint32_t BTRUAE;
    __IO uint32_t BTRDAE;
    __IO uint32_t BENBF;
    uint32_t RESERVED1[1];
    __IO uint32_t BTRUBF;
    __IO uint32_t BTRDBF;
    __IO uint32_t BENP;
    uint32_t RESERVED2[1];
    __IO uint32_t BTRUP;
    __IO uint32_t BTRDP;
    uint32_t RESERVED3[4];
    __IO uint32_t BENSPA;
    uint32_t RESERVED4[1];
    __IO uint32_t BTRUSPA;
    __IO uint32_t BTRDSPA;
    __IO uint32_t BENSPB;
    uint32_t RESERVED5[1];
    __IO uint32_t BTRUSPB;
    __IO uint32_t BTRDSPB;
    uint32_t RESERVED6[8];
} stc_hrpwm_bconr1_bit_t;

typedef struct {
    __IO uint32_t DTCEN;
    __IO uint32_t SEPA;
    uint32_t RESERVED0[2];
    __IO uint32_t DTBENU;
    __IO uint32_t DTBEND;
    __IO uint32_t DTBTRU;
    __IO uint32_t DTBTRD;
    uint32_t RESERVED1[24];
} stc_hrpwm_dconr_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENA;
    uint32_t RESERVED1[3];
} stc_hrpwm_pcnar1_bit_t;

typedef struct {
    uint32_t RESERVED0[28];
    __IO uint32_t OUTENB;
    uint32_t RESERVED1[3];
} stc_hrpwm_pcnbr1_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t SPPERIA;
    __IO uint32_t SPPERIB;
    uint32_t RESERVED1[22];
} stc_hrpwm_vperr_bit_t;

typedef struct {
    __IO uint32_t CMAF;
    __IO uint32_t CMBF;
    __IO uint32_t CMCF;
    __IO uint32_t CMDF;
    __IO uint32_t CMEF;
    __IO uint32_t CMFF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
    uint32_t RESERVED0[1];
    __IO uint32_t CMSAUF;
    __IO uint32_t CMSADF;
    __IO uint32_t CMSBUF;
    __IO uint32_t CMSBDF;
    uint32_t RESERVED1[13];
    __IO uint32_t CAPAF;
    __IO uint32_t CAPBF;
    uint32_t RESERVED2[3];
    __I  uint32_t DIRF;
} stc_hrpwm_stflr1_bit_t;

typedef struct {
    __IO uint32_t DLYIDLEA;
    __IO uint32_t DLYIDLEB;
    __IO uint32_t DLYPRT;
    uint32_t RESERVED0[1];
    __IO uint32_t OASTAT;
    __IO uint32_t OBSTAT;
    uint32_t RESERVED1[5];
    __IO uint32_t PHSCMP1F;
    __IO uint32_t PHSCMP2F;
    __IO uint32_t PHSCMP3F;
    __IO uint32_t PHSCMP4F;
    __IO uint32_t PHSCMP5F;
    __IO uint32_t OSTOVF;
    uint32_t RESERVED2[15];
} stc_hrpwm_stflr2_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t STAS;
    __IO uint32_t HSTA8;
    __IO uint32_t HSTA9;
    __IO uint32_t HSTA10;
    __IO uint32_t HSTA11;
    uint32_t RESERVED1[4];
    __IO uint32_t HSTA16;
    __IO uint32_t HSTA17;
    __IO uint32_t HSTA18;
    __IO uint32_t HSTA19;
    __IO uint32_t HSTA20;
    __IO uint32_t HSTA21;
    __IO uint32_t HSTA22;
    __IO uint32_t HSTA23;
    uint32_t RESERVED2[8];
} stc_hrpwm_hstar1_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t CLES;
    __IO uint32_t HCLE8;
    __IO uint32_t HCLE9;
    __IO uint32_t HCLE10;
    __IO uint32_t HCLE11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCLE16;
    __IO uint32_t HCLE17;
    __IO uint32_t HCLE18;
    __IO uint32_t HCLE19;
    __IO uint32_t HCLE20;
    __IO uint32_t HCLE21;
    __IO uint32_t HCLE22;
    __IO uint32_t HCLE23;
    uint32_t RESERVED2[8];
} stc_hrpwm_hclrr1_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t HCPA8;
    __IO uint32_t HCPA9;
    __IO uint32_t HCPA10;
    __IO uint32_t HCPA11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCPA16;
    __IO uint32_t HCPA17;
    __IO uint32_t HCPA18;
    __IO uint32_t HCPA19;
    __IO uint32_t HCPA20;
    __IO uint32_t HCPA21;
    __IO uint32_t HCPA22;
    __IO uint32_t HCPA23;
    uint32_t RESERVED2[8];
} stc_hrpwm_hcpar1_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t HCPB8;
    __IO uint32_t HCPB9;
    __IO uint32_t HCPB10;
    __IO uint32_t HCPB11;
    uint32_t RESERVED1[4];
    __IO uint32_t HCPB16;
    __IO uint32_t HCPB17;
    __IO uint32_t HCPB18;
    __IO uint32_t HCPB19;
    __IO uint32_t HCPB20;
    __IO uint32_t HCPB21;
    __IO uint32_t HCPB22;
    __IO uint32_t HCPB23;
    uint32_t RESERVED2[8];
} stc_hrpwm_hcpbr1_bit_t;

typedef struct {
    __IO uint32_t HCPAEEV1;
    __IO uint32_t HCPAEEV2;
    __IO uint32_t HCPAEEV3;
    __IO uint32_t HCPAEEV4;
    __IO uint32_t HCPAEEV5;
    __IO uint32_t HCPAEEV6;
    __IO uint32_t HCPAEEV7;
    __IO uint32_t HCPAEEV8;
    __IO uint32_t HCPAEEV9;
    __IO uint32_t HCPAEEV10;
    __IO uint32_t HCPAEN;
    uint32_t RESERVED0[21];
} stc_hrpwm_hcpar2_bit_t;

typedef struct {
    __IO uint32_t HCPBEEV1;
    __IO uint32_t HCPBEEV2;
    __IO uint32_t HCPBEEV3;
    __IO uint32_t HCPBEEV4;
    __IO uint32_t HCPBEEV5;
    __IO uint32_t HCPBEEV6;
    __IO uint32_t HCPBEEV7;
    __IO uint32_t HCPBEEV8;
    __IO uint32_t HCPBEEV9;
    __IO uint32_t HCPBEEV10;
    __IO uint32_t HCPBEN;
    uint32_t RESERVED0[21];
} stc_hrpwm_hcpbr2_bit_t;

typedef struct {
    __IO uint32_t BENEEFOFF;
    __IO uint32_t BTRUEEFOFF;
    __IO uint32_t BTRDEEFOFF;
    __IO uint32_t BENEEFWIN;
    __IO uint32_t BTRUEEFWIN;
    __IO uint32_t BTRDEEFWIN;
    __IO uint32_t BTRU0EEFOFF;
    __IO uint32_t BTRU0EEFWIN;
    __IO uint32_t BTRU0PEEFOFF;
    __IO uint32_t BTRU0PEEFWIN;
    uint32_t RESERVED0[2];
    __IO uint32_t BENCTL;
    __IO uint32_t BTRUCTL;
    __IO uint32_t BTRDCTL;
    uint32_t RESERVED1[1];
    __IO uint32_t BTRU0AE;
    __IO uint32_t BTRU0BF;
    __IO uint32_t BTRU0P;
    __IO uint32_t BTRU0SPA;
    __IO uint32_t BTRU0SPB;
    __IO uint32_t BTRU0DT;
    __IO uint32_t BTRU0CTL;
    __IO uint32_t BTRU0PAE;
    __IO uint32_t BTRU0PBF;
    __IO uint32_t BTRU0PP;
    __IO uint32_t BTRU0PSPA;
    __IO uint32_t BTRU0PSPB;
    __IO uint32_t BTRU0PDT;
    __IO uint32_t BTRU0PCTL;
    uint32_t RESERVED2[2];
} stc_hrpwm_bconr2_bit_t;

