MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t EN;
    uint32_t RESERVED1[28];
} stc_hrpwm_cr_bit_t;

typedef struct {
    __IO uint32_t PHSEN;
    uint32_t RESERVED0[5];
    __IO uint32_t PHSFORCA;
    __IO uint32_t PHSFORCB;
    __IO uint32_t BENPHS;
    __IO uint32_t BTRUPHS;
    __IO uint32_t BTRDPHS;
    uint32_t RESERVED1[21];
} stc_hrpwm_phsctl_bit_t;

typedef struct {
    __IO uint32_t CAL;
    __IO uint32_t CALEN;
    uint32_t RESERVED0[6];
    __IO uint32_t CALENF;
    __IO uint32_t ERRF;
    __IO uint32_t CALIE;
    uint32_t RESERVED1[21];
} stc_hrpwm_common_calcr_bit_t;

typedef struct {
    __O  uint32_t SCAP1A;
    __O  uint32_t SCAP1B;
    __O  uint32_t SCAP2A;
    __O  uint32_t SCAP2B;
    __O  uint32_t SCAP3A;
    __O  uint32_t SCAP3B;
    __O  uint32_t SCAP4A;
    __O  uint32_t SCAP4B;
    __O  uint32_t SCAP5A;
    __O  uint32_t SCAP5B;
    __O  uint32_t SCAP6A;
    __O  uint32_t SCAP6B;
    uint32_t RESERVED0[20];
} stc_hrpwm_common_scapr_bit_t;

typedef struct {
    __O  uint32_t SSTAIDL1A;
    __O  uint32_t SSTAIDL1B;
    __O  uint32_t SSTAIDL2A;
    __O  uint32_t SSTAIDL2B;
    __O  uint32_t SSTAIDL3A;
    __O  uint32_t SSTAIDL3B;
    __O  uint32_t SSTAIDL4A;
    __O  uint32_t SSTAIDL4B;
    __O  uint32_t SSTAIDL5A;
    __O  uint32_t SSTAIDL5B;
    __O  uint32_t SSTAIDL6A;
    __O  uint32_t SSTAIDL6B;
    uint32_t RESERVED0[20];
} stc_hrpwm_common_sstaidlr_bit_t;

typedef struct {
    __IO uint32_t SSTARUN1A;
    __IO uint32_t SSTARUN1B;
    __IO uint32_t SSTARUN2A;
    __IO uint32_t SSTARUN2B;
    __IO uint32_t SSTARUN3A;
    __IO uint32_t SSTARUN3B;
    __IO uint32_t SSTARUN4A;
    __IO uint32_t SSTARUN4B;
    __IO uint32_t SSTARUN5A;
    __IO uint32_t SSTARUN5B;
    __IO uint32_t SSTARUN6A;
    __IO uint32_t SSTARUN6B;
    uint32_t RESERVED0[20];
} stc_hrpwm_common_sstarunr1_bit_t;

typedef struct {
    __O  uint32_t SSTARUN1A2;
    __O  uint32_t SSTARUN1B2;
    __O  uint32_t SSTARUN2A2;
    __O  uint32_t SSTARUN2B2;
    __O  uint32_t SSTARUN3A2;
    __O  uint32_t SSTARUN3B2;
    __O  uint32_t SSTARUN4A2;
    __O  uint32_t SSTARUN4B2;
    __O  uint32_t SSTARUN5A2;
    __O  uint32_t SSTARUN5B2;
    __O  uint32_t SSTARUN6A2;
    __O  uint32_t SSTARUN6B2;
    uint32_t RESERVED0[20];
} stc_hrpwm_common_sstarunr2_bit_t;

typedef struct {
    __O  uint32_t DLYSTRGU1;
    __O  uint32_t DLYSTRGU2;
    __O  uint32_t DLYSTRGU3;
    __O  uint32_t DLYSTRGU4;
    __O  uint32_t DLYSTRGU5;
    __O  uint32_t DLYSTRGU6;
    uint32_t RESERVED0[26];
} stc_hrpwm_common_sstadidlr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t BKDLY1;
    __IO uint32_t BKDLY2;
    __IO uint32_t BKDLY3;
    __IO uint32_t BKDLY4;
    __IO uint32_t BKDLY5;
    __IO uint32_t BKDLY6;
    uint32_t RESERVED1[22];
} stc_hrpwm_common_gctlr_bit_t;

typedef struct {
    __IO uint32_t BTRU1EN;
    __IO uint32_t BTRU2EN;
    __IO uint32_t BTRU3EN;
    __IO uint32_t BTRU4EN;
    __IO uint32_t BTRU5EN;
    __IO uint32_t BTRU6EN;
    uint32_t RESERVED0[2];
    __IO uint32_t BTRU1SFT;
    __IO uint32_t BTRU2SFT;
    __IO uint32_t BTRU3SFT;
    __IO uint32_t BTRU4SFT;
    __IO uint32_t BTRU5SFT;
    __IO uint32_t BTRU6SFT;
    uint32_t RESERVED1[16];
    __O  uint32_t OSTBTRU1;
    __IO uint32_t OSTENU1;
} stc_hrpwm_common_gbconr_bit_t;

typedef struct {
    __IO uint32_t U1BTRENF;
    __IO uint32_t U2BTRENF;
    __IO uint32_t U3BTRENF;
    __IO uint32_t U4BTRENF;
    __IO uint32_t U5BTRENF;
    __IO uint32_t U6BTRENF;
    uint32_t RESERVED0[26];
} stc_hrpwm_common_gbsflr_bit_t;

typedef struct {
    __IO uint32_t BMEN;
    __IO uint32_t BMCTN;
    uint32_t RESERVED0[8];
    __IO uint32_t BMTMR1;
    __IO uint32_t BMTMR2;
    __IO uint32_t BMTMR3;
    __IO uint32_t BMTMR4;
    __IO uint32_t BMTMR5;
    __IO uint32_t BMTMR6;
    __IO uint32_t BMOPTF;
    __IO uint32_t BMOVFF;
    __IO uint32_t INTENBMOVF;
    __IO uint32_t BENBMCMP;
    __IO uint32_t BENBMP;
    __IO uint32_t BMMD;
    uint32_t RESERVED1[10];
} stc_hrpwm_common_bmcr_bit_t;

typedef struct {
    __O  uint32_t SSTRG;
    __IO uint32_t OVF1;
    __IO uint32_t UDF1;
    __IO uint32_t GCMA1;
    __IO uint32_t GCMB1;
    __IO uint32_t OVF2;
    __IO uint32_t UDF2;
    __IO uint32_t GCMA2;
    __IO uint32_t GCMB2;
    __IO uint32_t OVF3;
    __IO uint32_t UDF3;
    __IO uint32_t GCMA3;
    __IO uint32_t GCMB3;
    __IO uint32_t OVF4;
    __IO uint32_t UDF4;
    __IO uint32_t GCMA4;
    __IO uint32_t GCMB4;
    __IO uint32_t OVF5;
    __IO uint32_t UDF5;
    __IO uint32_t GCMA5;
    __IO uint32_t GCMB5;
    __IO uint32_t OVF6;
    __IO uint32_t UDF6;
    __IO uint32_t GCMA6;
    __IO uint32_t GCMB6;
    __IO uint32_t T1OVFEEV7;
    __IO uint32_t T1UDFEEV7;
    __IO uint32_t T4OVFEEV8;
    __IO uint32_t T4UDFEEV8;
    __IO uint32_t EEV7;
    __IO uint32_t EEV8;
    uint32_t RESERVED0[1];
} stc_hrpwm_common_bmstrg1_bit_t;

typedef struct {
    __IO uint32_t IEV0;
    __IO uint32_t IEV1;
    __IO uint32_t IEV2;
    __IO uint32_t IEV3;
    uint32_t RESERVED0[28];
} stc_hrpwm_common_bmstrg2_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t EE1POL;
    uint32_t RESERVED1[2];
    __IO uint32_t EE1FAST;
    uint32_t RESERVED2[2];
    __IO uint32_t EE2POL;
    uint32_t RESERVED3[2];
    __IO uint32_t EE2FAST;
    uint32_t RESERVED4[2];
    __IO uint32_t EE3POL;
    uint32_t RESERVED5[2];
    __IO uint32_t EE3FAST;
    uint32_t RESERVED6[2];
    __IO uint32_t EE4POL;
    uint32_t RESERVED7[2];
    __IO uint32_t EE4FAST;
    uint32_t RESERVED8[2];
    __IO uint32_t EE5POL;
    uint32_t RESERVED9[2];
    __IO uint32_t EE5FAST;
    uint32_t RESERVED10[2];
} stc_hrpwm_common_eecr1_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t EE6POL;
    uint32_t RESERVED1[5];
    __IO uint32_t EE7POL;
    uint32_t RESERVED2[5];
    __IO uint32_t EE8POL;
    uint32_t RESERVED3[5];
    __IO uint32_t EE9POL;
    uint32_t RESERVED4[5];
    __IO uint32_t EE10POL;
    uint32_t RESERVED5[5];
} stc_hrpwm_common_eecr2_bit_t;

