MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334F8UI/mcu.h
typedef struct {
    __IO uint32_t AR0;
    __IO uint32_t AR1;
    __IO uint32_t AR2;
    __IO uint32_t AR3;
    __IO uint32_t AR4;
    __IO uint32_t AR5;
    __IO uint32_t AR6;
    __IO uint32_t AR7;
    __IO uint32_t AR8;
    __IO uint32_t AR9;
    __IO uint32_t AR10;
    __IO uint32_t AR11;
    __IO uint32_t AR12;
    __IO uint32_t AR13;
    __IO uint32_t AR14;
    __IO uint32_t AR15;
    __IO uint32_t AR16;
    __IO uint32_t AR17;
    __IO uint32_t AR18;
    __IO uint32_t AR19;
    __IO uint32_t AR20;
    __IO uint32_t AR21;
    __IO uint32_t AR22;
    __IO uint32_t AR23;
    __IO uint32_t AR24;
    __IO uint32_t AR25;
    __IO uint32_t AR26;
    __IO uint32_t AR27;
    __IO uint32_t AR28;
    __IO uint32_t AR29;
    __IO uint32_t AR30;
    __IO uint32_t AR31;
} stc_mcan_txbar_bit_t;

typedef struct {
    __IO uint32_t CR0;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t CR4;
    __IO uint32_t CR5;
    __IO uint32_t CR6;
    __IO uint32_t CR7;
    __IO uint32_t CR8;
    __IO uint32_t CR9;
    __IO uint32_t CR10;
    __IO uint32_t CR11;
    __IO uint32_t CR12;
    __IO uint32_t CR13;
    __IO uint32_t CR14;
    __IO uint32_t CR15;
    __IO uint32_t CR16;
    __IO uint32_t CR17;
    __IO uint32_t CR18;
    __IO uint32_t CR19;
    __IO uint32_t CR20;
    __IO uint32_t CR21;
    __IO uint32_t CR22;
    __IO uint32_t CR23;
    __IO uint32_t CR24;
    __IO uint32_t CR25;
    __IO uint32_t CR26;
    __IO uint32_t CR27;
    __IO uint32_t CR28;
    __IO uint32_t CR29;
    __IO uint32_t CR30;
    __IO uint32_t CR31;
} stc_mcan_txbcr_bit_t;

typedef struct {
    __I  uint32_t TO0;
    __I  uint32_t TO1;
    __I  uint32_t TO2;
    __I  uint32_t TO3;
    __I  uint32_t TO4;
    __I  uint32_t TO5;
    __I  uint32_t TO6;
    __I  uint32_t TO7;
    __I  uint32_t TO8;
    __I  uint32_t TO9;
    __I  uint32_t TO10;
    __I  uint32_t TO11;
    __I  uint32_t TO12;
    __I  uint32_t TO13;
    __I  uint32_t TO14;
    __I  uint32_t TO15;
    __I  uint32_t TO16;
    __I  uint32_t TO17;
    __I  uint32_t TO18;
    __I  uint32_t TO19;
    __I  uint32_t TO20;
    __I  uint32_t TO21;
    __I  uint32_t TO22;
    __I  uint32_t TO23;
    __I  uint32_t TO24;
    __I  uint32_t TO25;
    __I  uint32_t TO26;
    __I  uint32_t TO27;
    __I  uint32_t TO28;
    __I  uint32_t TO29;
    __I  uint32_t TO30;
    __I  uint32_t TO31;
} stc_mcan_txbto_bit_t;

typedef struct {
    __I  uint32_t CF0;
    __I  uint32_t CF1;
    __I  uint32_t CF2;
    __I  uint32_t CF3;
    __I  uint32_t CF4;
    __I  uint32_t CF5;
    __I  uint32_t CF6;
    __I  uint32_t CF7;
    __I  uint32_t CF8;
    __I  uint32_t CF9;
    __I  uint32_t CF10;
    __I  uint32_t CF11;
    __I  uint32_t CF12;
    __I  uint32_t CF13;
    __I  uint32_t CF14;
    __I  uint32_t CF15;
    __I  uint32_t CF16;
    __I  uint32_t CF17;
    __I  uint32_t CF18;
    __I  uint32_t CF19;
    __I  uint32_t CF20;
    __I  uint32_t CF21;
    __I  uint32_t CF22;
    __I  uint32_t CF23;
    __I  uint32_t CF24;
    __I  uint32_t CF25;
    __I  uint32_t CF26;
    __I  uint32_t CF27;
    __I  uint32_t CF28;
    __I  uint32_t CF29;
    __I  uint32_t CF30;
    __I  uint32_t CF31;
} stc_mcan_txbcf_bit_t;

typedef struct {
    __IO uint32_t TIE0;
    __IO uint32_t TIE1;
    __IO uint32_t TIE2;
    __IO uint32_t TIE3;
    __IO uint32_t TIE4;
    __IO uint32_t TIE5;
    __IO uint32_t TIE6;
    __IO uint32_t TIE7;
    __IO uint32_t TIE8;
    __IO uint32_t TIE9;
    __IO uint32_t TIE10;
    __IO uint32_t TIE11;
    __IO uint32_t TIE12;
    __IO uint32_t TIE13;
    __IO uint32_t TIE14;
    __IO uint32_t TIE15;
    __IO uint32_t TIE16;
    __IO uint32_t TIE17;
    __IO uint32_t TIE18;
    __IO uint32_t TIE19;
    __IO uint32_t TIE20;
    __IO uint32_t TIE21;
    __IO uint32_t TIE22;
    __IO uint32_t TIE23;
    __IO uint32_t TIE24;
    __IO uint32_t TIE25;
    __IO uint32_t TIE26;
    __IO uint32_t TIE27;
    __IO uint32_t TIE28;
    __IO uint32_t TIE29;
    __IO uint32_t TIE30;
    __IO uint32_t TIE31;
} stc_mcan_txbtie_bit_t;

typedef struct {
    __IO uint32_t CFIE0;
    __IO uint32_t CFIE1;
    __IO uint32_t CFIE2;
    __IO uint32_t CFIE3;
    __IO uint32_t CFIE4;
    __IO uint32_t CFIE5;
    __IO uint32_t CFIE6;
    __IO uint32_t CFIE7;
    __IO uint32_t CFIE8;
    __IO uint32_t CFIE9;
    __IO uint32_t CFIE10;
    __IO uint32_t CFIE11;
    __IO uint32_t CFIE12;
    __IO uint32_t CFIE13;
    __IO uint32_t CFIE14;
    __IO uint32_t CFIE15;
    __IO uint32_t CFIE16;
    __IO uint32_t CFIE17;
    __IO uint32_t CFIE18;
    __IO uint32_t CFIE19;
    __IO uint32_t CFIE20;
    __IO uint32_t CFIE21;
    __IO uint32_t CFIE22;
    __IO uint32_t CFIE23;
    __IO uint32_t CFIE24;
    __IO uint32_t CFIE25;
    __IO uint32_t CFIE26;
    __IO uint32_t CFIE27;
    __IO uint32_t CFIE28;
    __IO uint32_t CFIE29;
    __IO uint32_t CFIE30;
    __IO uint32_t CFIE31;
} stc_mcan_txbcie_bit_t;

typedef struct {
    uint32_t RESERVED0[24];
    __I  uint32_t EFF;
    __I  uint32_t TEFL;
    uint32_t RESERVED1[6];
} stc_mcan_txefs_bit_t;

typedef struct {
    __IO uint32_t RAM_1ERR;
    __IO uint32_t RAM_2ERR;
    uint32_t RESERVED0[30];
} stc_mcanram_cksr_bit_t;

typedef struct {
    __IO uint32_t EIEN;
    uint32_t RESERVED0[31];
} stc_mcanram_eien_bit_t;

typedef struct {
    __I  uint32_t SMPU1EAF;
    __I  uint32_t PSPEF;
    __I  uint32_t MSPEF;
    uint32_t RESERVED0[29];
} stc_mpu_sr_bit_t;

typedef struct {
    __O  uint32_t SMPU1ECLR;
    __O  uint32_t PSPECLR;
    __O  uint32_t MSPECLR;
    uint32_t RESERVED0[29];
} stc_mpu_eclr_bit_t;

typedef struct {
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t EFMRDP;
    __IO uint32_t EFMWRP;
    uint32_t RESERVED1[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED2[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

